load_test_results.txt
=== Нагрузочное тестирование PortfolioPro ===
Старт: Sat Apr 25 15:23:17 RTZ 2026

[1/6] GET /api/v1/projects (c=20, d=10)
Running 10s test @ http://localhost:5000/api/v1/projects
20 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 42 ms │ 51 ms │ 72 ms │ 84 ms │ 53.26 ms │ 9.39 ms │ 136 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 276    │ 276    │ 382    │ 416    │ 372    │ 40,87   │ 276    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 522 kB │ 522 kB │ 722 kB │ 787 kB │ 703 kB │ 77.3 kB │ 522 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

4k requests in 10.06s, 7.03 MB read

[2/6] POST /api/v1/auth/login (c=10, d=10)
Running 10s test @ http://localhost:5000/api/v1/auth/login
10 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬─────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev   │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼─────────┼────────┤
│ Latency │ 793 ms │ 805 ms │ 824 ms │ 824 ms │ 804.98 ms │ 8.79 ms │ 824 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 10      │ 10      │ 10      │ 20      │ 12      │ 3,77    │ 10      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 5.07 kB │ 5.07 kB │ 5.07 kB │ 10.1 kB │ 6.08 kB │ 1.91 kB │ 5.07 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

130 requests in 10.1s, 60.8 kB read

[3/6] GET /api/v1/resumes (c=15, d=10)
Running 10s test @ http://localhost:5000/api/v1/resumes
15 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬───────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max   │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼───────┤
│ Latency │ 21 ms │ 30 ms │ 41 ms │ 45 ms │ 30.21 ms │ 5.38 ms │ 81 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴───────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 403    │ 403    │ 494    │ 515    │ 488,3  │ 32,6    │ 403    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 419 kB │ 419 kB │ 513 kB │ 535 kB │ 507 kB │ 33.9 kB │ 418 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

5k requests in 10.05s, 5.07 MB read

[4/6] GET /api/v1/skills (c=20, d=10)
Running 10s test @ http://localhost:5000/api/v1/skills
20 connections


┌─────────┬───────┬───────┬───────┬───────┬─────────┬─────────┬───────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max   │
├─────────┼───────┼───────┼───────┼───────┼─────────┼─────────┼───────┤
│ Latency │ 29 ms │ 39 ms │ 47 ms │ 50 ms │ 38.4 ms │ 4.88 ms │ 61 ms │
└─────────┴───────┴───────┴───────┴───────┴─────────┴─────────┴───────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 477    │ 477    │ 515    │ 530    │ 513,8  │ 13,85   │ 477    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 629 kB │ 629 kB │ 679 kB │ 699 kB │ 677 kB │ 18.4 kB │ 629 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

5k requests in 10.05s, 6.77 MB read

[5/6] POST /api/v1/analytics/recommend (c=10, d=10)
Running 10s test @ http://localhost:5000/api/v1/analytics/recommend
10 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬─────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev   │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼─────────┼────────┤
│ Latency │ 632 ms │ 639 ms │ 981 ms │ 981 ms │ 657.29 ms │ 83.9 ms │ 981 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 10      │ 10      │ 11      │ 20      │ 15,1    │ 4,91    │ 10      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 7.06 kB │ 7.06 kB │ 7.77 kB │ 14.1 kB │ 10.7 kB │ 3.47 kB │ 7.06 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

161 requests in 10.12s, 107 kB read

[6/6] POST /api/v1/projects (c=5, d=10)
Running 10s test @ http://localhost:5000/api/v1/projects
5 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬───────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max   │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼───────┤
│ Latency │ 13 ms │ 15 ms │ 19 ms │ 21 ms │ 15.13 ms │ 2.25 ms │ 54 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴───────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 270    │ 270    │ 319    │ 340    │ 319,3  │ 21,51   │ 270    │
├───────────┼────────┼────────┼────────┼────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 185 kB │ 185 kB │ 220 kB │ 234 kB │ 220 kB │ 14.9 kB │ 185 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

3k requests in 10.04s, 2.2 MB read

=== Тестирование завершено: Sat Apr 25 15:24:24 RTZ 2026 ===